RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ethif.c
/*******************************************************************************
* Function Name: Cy_ETHIF_MdioInit
****************************************************************************//**
*
* \brief Initializes the Ethernet MAC with minimal parameters which is required to
*        enable mdio interface.
*
* \param base
* Pointer to register area of Ethernet MAC
*
* \param pstcEthIfConfig
* Pointer to Ethernet configuration parameters
*
* \return CY_ETHIF_SUCCESS      Ethernet MAC has been initialized along with
*                               Cadence driver and external PHY
* \return CY_ETHIF_BAD_PARAM    If following conditions are met:
*                               pstcEth == NULL
*                               pstcEthIfConfig == NULL
*                               GEM_GXL Object could not be created.
*
* \note
* This function Initializes the Ethernet MAC partially. This function is only
* required if user wants to access PHY registers before \ref Cy_ETHIF_Init().
*******************************************************************************/
cy_en_ethif_status_t Cy_ETHIF_MdioInit(ETH_Type *base, cy_stc_ethif_mac_config_t * pstcEthIfConfig)
{
    uint8_t u8EthIfInstance;
    uint32_t u32RetValue;
    cy_en_ethif_status_t status = CY_ETHIF_SUCCESS;

    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base) || (pstcEthIfConfig == NULL))
    {
        return CY_ETHIF_BAD_PARAM;
    }
    else if (pstcEthIfConfig->pstcWrapperConfig == NULL)
    {
        return CY_ETHIF_BAD_PARAM;
    }
    else
    {
        /**/
    }

    cyp_ethif_gemgxlobj = CEDI_GetInstance();
    if (cyp_ethif_gemgxlobj == NULL)
    {
        status = CY_ETHIF_BAD_PARAM;
    }

    if (status == CY_ETHIF_SUCCESS)
    {
        /** Load the Ethernet instance */
        u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

        /* Load Init parameter */
        Cy_ETHIF_PrepareConfiguration(u8EthIfInstance, pstcEthIfConfig);

        /* Initialize ENET MAC Wrapper */
        if (CY_ETHIF_BAD_PARAM == Cy_ETHIF_WrapperConfig(u8EthIfInstance, pstcEthIfConfig->pstcWrapperConfig))
        {
            Cy_ETHIF_IPDisable(base);
            return CY_ETHIF_BAD_PARAM;
        }

        /* Enable the IP to access EMAC registers set */
        Cy_ETHIF_IPEnable(base);

        /* assign starting addresses to local variable */
        Cy_ETHIF_AssignMemory(u8EthIfInstance);

        /* Initialization EMAC registers */
        u32RetValue = cyp_ethif_gemgxlobj->init((void *)cyp_ethif_pd[u8EthIfInstance], &cy_ethif_cfg[u8EthIfInstance], &Cy_ETHIF_Callbacks);
        if (u32RetValue == ((uint32_t)EINVAL) || u32RetValue == ((uint32_t)ENOTSUP))
        {
            Cy_ETHIF_IPDisable(base);
            return CY_ETHIF_BAD_PARAM;
        }

        /* Enable MDIO */
        cyp_ethif_gemgxlobj->setMdioEnable((void *)(void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);
    }
    return status;
}



/*******************************************************************************
* Function Name: Cy_ETHIF_Init
****************************************************************************//**
*
* \brief Initializes the Ethernet MAC, Cadence Driver, EthIf and PHY
*
* \param base
* Pointer to register area of Ethernet MAC
*
* \param pstcEthIfConfig
* Pointer to Ethernet configuration parameters
*
* \param pstcInterruptList
* List of Interrupts to enable
*
* \return CY_ETHIF_SUCCESS      Ethernet MAC has been initialized along with
*                               Cadence driver and external PHY
* \return CY_ETHIF_BAD_PARAM    If following conditions are met:
*                               pstcEth == NULL
*                               pstcEthIfConfig == NULL
*                               pstcInterruptList == NULL
*                               GEM_GXL Object could not be created
*                               Memory assigned by Interface layer is not enough
*                               Cadence driver could not initialize Ethernet MAC
* \return CY_ETHIF_MEMORY_NOT_ENOUGH
*                               Assigned memory for BDs or for Private data is
*                               not enough
*
* \note
* This function Initializes the Ethernet MAC, Cadence driver, EthIf layer and
* external PHY with the provided parameters. Port init for the Ethernet must be
* done before calling Cy_ETHIF_Init function. Buffer configuration parameters
* shall be done in cy_ethif.h file
*******************************************************************************/
cy_en_ethif_status_t Cy_ETHIF_Init(ETH_Type *base, cy_stc_ethif_mac_config_t * pstcEthIfConfig, cy_stc_ethif_intr_config_t * pstcInterruptList)
{
    // local variable declaration
    uint32_t u32RetValue = 0;
    uint8_t u8EthIfInstance = 255;
    uint8_t u8tmpcounter = 0;
    uint8_t u8tmpintrcntr = 0;
    uint16_t u16SysReqTxBDLength = 0;
    uint16_t u16SysReqRxBDLength = 0;
    static bool bBufferInitialized = false;
    CEDI_BuffAddr rx_buff_addr;

    /* Parameter checks */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base) || (pstcEthIfConfig == NULL) || (pstcInterruptList == NULL))
    {
        return CY_ETHIF_BAD_PARAM;
    }
    else if (pstcEthIfConfig->pstcWrapperConfig == NULL)
    {
        return CY_ETHIF_BAD_PARAM;
    }
    else
    {
        /**/
    }

    if (bBufferInitialized == false)
    {
        /* Create GEM_GXL object  */
        cyp_ethif_gemgxlobj = CEDI_GetInstance();
        if (cyp_ethif_gemgxlobj == NULL)
        {
            return CY_ETHIF_BAD_PARAM;
        }
    }

    /** Load the Ethernet instance */
    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    /* Load Init parameter */
    Cy_ETHIF_PrepareConfiguration(u8EthIfInstance, pstcEthIfConfig);

    if (pstcEthIfConfig->bintrEnable == true)
    {
        /* Configure Interrupts */
        Cy_ETHIF_EnableInterrupts(u8EthIfInstance, pstcInterruptList);

        /* Init Callback functions */
        stccallbackfunctions[u8EthIfInstance].rxframecb       = NULL;
        stccallbackfunctions[u8EthIfInstance].txerrorcb       = NULL;
        stccallbackfunctions[u8EthIfInstance].txcompletecb    = NULL;
        stccallbackfunctions[u8EthIfInstance].tsuSecondInccb  = NULL;
        stccallbackfunctions[u8EthIfInstance].rxgetbuff  = NULL;
    }

