RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ethif.c
    /* Initialize ENET MAC Wrapper */
    if (CY_ETHIF_BAD_PARAM == Cy_ETHIF_WrapperConfig(u8EthIfInstance, pstcEthIfConfig->pstcWrapperConfig))
    {
        Cy_ETHIF_IPDisable(base);
        return CY_ETHIF_BAD_PARAM;
    }

    /* Enable the IP to access EMAC registers set */
    Cy_ETHIF_IPEnable(base);

    /* Probe for checking configuration parameters and calculating memory size */
    (void)cyp_ethif_gemgxlobj->probe(&cy_ethif_cfg[u8EthIfInstance], &cy_ethif_sysreq);

    /* Check for assigned memory and required memory match */
    u16SysReqTxBDLength = (uint16_t)((cy_ethif_sysreq.txDescListSize /  CY_ETH_DEFINE_NUM_TXQS)/(CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE + 1U));
    u16SysReqRxBDLength = (uint16_t)((cy_ethif_sysreq.rxDescListSize /  CY_ETH_DEFINE_NUM_RXQS)/(CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE + 1U));

    if ((u16SysReqTxBDLength != CY_ETH_BD_SIZE) || (u16SysReqRxBDLength != CY_ETH_BD_SIZE))
    {
        /* Memory not enough */
        return CY_ETHIF_MEMORY_NOT_ENOUGH;
    }

    /* assign starting addresses to local variable */
    Cy_ETHIF_AssignMemory(u8EthIfInstance);

    if (sizeof(cy_ethif_privatedata[u8EthIfInstance])< cy_ethif_sysreq.privDataSize)
    {
        /* Memory not enough */
        return CY_ETHIF_MEMORY_NOT_ENOUGH;
    }


    /* Initialization EMAC registers */
    u32RetValue = cyp_ethif_gemgxlobj->init((void *)cyp_ethif_pd[u8EthIfInstance], &cy_ethif_cfg[u8EthIfInstance], &Cy_ETHIF_Callbacks);
    if (u32RetValue == ((uint32_t)EINVAL) || u32RetValue == ((uint32_t)ENOTSUP))
    {
        Cy_ETHIF_IPDisable(base);
        return CY_ETHIF_BAD_PARAM;
    }

    /* Disable Transmit and Receive Queues */
    (void)Cy_ETHIF_DisableQueues(base, pstcEthIfConfig);

    /* TSU Initialization */
    if (NULL != pstcEthIfConfig->pstcTSUConfig)
    {
        if (CY_ETHIF_BAD_PARAM == Cy_ETHIF_TSUInit(u8EthIfInstance, pstcEthIfConfig->pstcTSUConfig))
        {
            Cy_ETHIF_IPDisable(base);
            return CY_ETHIF_BAD_PARAM;
        }
    }

    /* Initialize Buffer status */
    if (bBufferInitialized == false)
    {
        Cy_ETHIF_InitializeBuffers();
        bBufferInitialized = true;
    }

    for (u8tmpcounter = 0; u8tmpcounter < cy_ethif_cfg[u8EthIfInstance].rxQs; u8tmpcounter++)
    {
        if (pstcEthIfConfig->pRxQbuffPool[u8tmpcounter] != NULL)
        {
            for (u8tmpintrcntr = 0; u8tmpintrcntr < cy_ethif_cfg[u8EthIfInstance].rxQLen[u8tmpcounter]; u8tmpintrcntr++)
            {
                rx_buff_addr.vAddr = (uintptr_t)((*pstcEthIfConfig->pRxQbuffPool)[u8tmpcounter][u8tmpintrcntr]);
                rx_buff_addr.pAddr = rx_buff_addr.vAddr;
                (void)cyp_ethif_gemgxlobj->addRxBuf((void *)cyp_ethif_pd[u8EthIfInstance],
                                                u8tmpcounter,
                                            (CEDI_BuffAddr *)&rx_buff_addr,
                                                0);
            }
        }
    }


    /* additional Receive configurations */
    cyp_ethif_gemgxlobj->setCopyAllFrames((void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);
    cyp_ethif_gemgxlobj->setRxBadPreamble((void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);

    /* Do not drop frames with CRC error */
    cyp_ethif_gemgxlobj->setIgnoreFcsRx((void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);

    // Optional: Setting Filter configuration
    // Optional: setting screen registers

    /* Enable MDIO */
    cyp_ethif_gemgxlobj->setMdioEnable((void *)(void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);
    /* driver start */
    cyp_ethif_gemgxlobj->start((void *)cyp_ethif_pd[u8EthIfInstance]);

    return CY_ETHIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_RegisterCallbacks
****************************************************************************//**
*
* \brief Function loads callback functions to its local data structures.
*        The callback functions are called from ISR context.
*
* \param base
* Pointer to register area of Ethernet MAC
*
* \param cbFuncsList pointer to callback function list
*
*******************************************************************************/
void Cy_ETHIF_RegisterCallbacks(ETH_Type *base, cy_stc_ethif_cb_t *cbFuncsList)
{
    uint8_t u8EthIfInstance;
    /* Load the Ethernet instance */
    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    /* Load Callback functions */
    stccallbackfunctions[u8EthIfInstance].rxframecb       = cbFuncsList->rxframecb;
    stccallbackfunctions[u8EthIfInstance].txerrorcb       = cbFuncsList->txerrorcb;
    stccallbackfunctions[u8EthIfInstance].txcompletecb    = cbFuncsList->txcompletecb;
    stccallbackfunctions[u8EthIfInstance].tsuSecondInccb  = cbFuncsList->tsuSecondInccb;
    stccallbackfunctions[u8EthIfInstance].rxgetbuff       = cbFuncsList->rxgetbuff;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_TransmitFrame
****************************************************************************//**
*
* \brief Function initiates transmission of frame data
*
* \param base
* Pointer to register area of Ethernet MAC
*
* \param pu8TxBuffer pointer to Transmit source buffer. Its caller's responsibility to
*                    make sure this buffer is not overwritten until transmit is not
*                    completed. \ref Cy_ETHIF_RegisterCallbacks for Tx completion callback.
* \param u16Length Length of data to transmit from source buffer, Length should include source
*                  and destination buffer address. CRC bytes shall not be included in the length
* \param u8QueueIndex Queue to be used to transmit the frame
* \param bEndBuffer True - Last buffer of the frame to be transmitted.
*                   False - Other Buffers to be provided after function call
*                           IP will not start transmitting until it gets EndBuffer True.
*
* \return CY_ETHIF_SUCCESS Frame transmission started
* \return CY_ETHIF_BAD_PARAM Parameter passed contains invalid values
* \return CY_ETHIF_BUFFER_NOT_AVAILABLE Buffer not available to load the source data
*
*******************************************************************************/
cy_en_ethif_status_t Cy_ETHIF_TransmitFrame(ETH_Type *base, uint8_t * pu8TxBuffer, uint16_t u16Length, uint8_t u8QueueIndex, bool bEndBuffer)
{
    uint8_t u8EthIfInstance;
    uint8_t u8flags = 0;
    uint32_t u32result = 0;
    CEDI_BuffAddr tmpBuffAdd;

