RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ethif.c
    /* Check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        return CY_ETHIF_BAD_PARAM;
    }

    /* Check for arguments */
    if ((pu8TxBuffer == NULL) || (u16Length > CY_ETH_SIZE_MAX_FRAME) || (u8QueueIndex > CY_ETH_QS2_2))
    {
        return CY_ETHIF_BAD_PARAM;
    }

    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    /* Check requested queue enabled or not */
    if (stcQueueDisStatus[u8EthIfInstance].bTxQueueDisable[u8QueueIndex] == true)
    {
        /* Requested Queue is disabled */
        return CY_ETHIF_BAD_PARAM;
    }

    tmpBuffAdd.pAddr = (uintptr_t)pu8TxBuffer;
    tmpBuffAdd.vAddr = tmpBuffAdd.pAddr;

#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
    SCB_CleanDCache_by_Addr((void*) (tmpBuffAdd.pAddr), (int32_t)u16Length);
#endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */

    /* Typecast bEndBuffer to Flag type    */
    // TODO: adapt function for CEDI_TXB_NO_AUTO_CRC and CEDI_TXB_NO_AUTO_START
    if (bEndBuffer == true)
    {
        u8flags = CEDI_TXB_LAST_BUFF;
    }

    /* Clear transmit status register before begin to transmit */
    cyp_ethif_gemgxlobj->clearTxStatus((void *)cyp_ethif_pd[u8EthIfInstance], CY_ETHIF_TX_STATUS_CLEAR);

    g_tx_bdcount[u8EthIfInstance]++;

    /* wait until tx done successfully */
    while (g_tx_bdcount[u8EthIfInstance] > CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE)
    {
        /* Do Nothing */
        //Cy_SysLib_DelayUs(1);
    }

    /* Trigger Internal transmit function  */
    u32result = cyp_ethif_gemgxlobj->queueTxBuf((void *)cyp_ethif_pd[u8EthIfInstance],
                                       u8QueueIndex,
                                       (CEDI_BuffAddr*)&tmpBuffAdd,
                                       u16Length,
                                       u8flags);
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3');

    if (0UL != u32result)
    {
        /* error   */
        return CY_ETHIF_BAD_PARAM;
    }

    return CY_ETHIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_TxPauseFrame
****************************************************************************//**
*
* \brief Transmits IEEE 802.3X standard Pause Frame
*
* \param base
* Pointer to register area of Ethernet MAC
*
* \param bZeroTQ  True - Zero Time Quanta
*        bZeroTQ  False - Transmit pause frame with set time quanta
*
* \return CY_ETHIF_SUCCESS for success
* \return CY_ETHIF_BAD_PARAM for wrong input parameters
* \note If interrupt enabled, interrupt will be triggered at the end of the transmission
*
*******************************************************************************/
cy_en_ethif_status_t Cy_ETHIF_TxPauseFrame(ETH_Type *base, bool bZeroTQ)
{
    uint8_t u8EthIfInstance;
    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        return CY_ETHIF_BAD_PARAM;
    }

    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    if (bZeroTQ == true)
    {
        /* trigger Pause frame with Zero Time Quanta */
        cyp_ethif_gemgxlobj->txZeroQPause((void *)cyp_ethif_pd[u8EthIfInstance]);
    }
    else
    {
        cyp_ethif_gemgxlobj->txPauseFrame((void *)cyp_ethif_pd[u8EthIfInstance]);
    }

    return CY_ETHIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_ConfigPause
****************************************************************************//**
*
* \brief Configures the Pause Frame transmission according to IEEE 802.3X standard
*
* \param base
* Pointer to register area of Ethernet MAC
* \param u16PauseQuanta Time Quanta
*
* \return CY_ETHIF_SUCCESS for success
* \return CY_ETHIF_BAD_PARAM for wrong input parameters
*
*******************************************************************************/
cy_en_ethif_status_t Cy_ETHIF_ConfigPause(ETH_Type *base, uint16_t u16PauseQuanta)
{
    uint8_t u8EthIfInstance;
    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        return CY_ETHIF_BAD_PARAM;
    }

    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    /* Set Tx Pause Quanta for Priority 0   */
    if (((uint32_t)EOK) != cyp_ethif_gemgxlobj->setTxPauseQuantum((void *)cyp_ethif_pd[u8EthIfInstance], u16PauseQuanta, CY_ETHIF_PAUSE_P0))
    {
        return CY_ETHIF_BAD_PARAM;
    }

    /* Enable Receive Pause Frames */
    cyp_ethif_gemgxlobj->setCopyPauseDisable((void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_DISABLE_0);

    /* Enable Pause Frames */
    cyp_ethif_gemgxlobj->setPauseEnable((void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);

    return CY_ETHIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_SetNoBroadCast
****************************************************************************//**
*
* \brief Enable/Disable receive of broadcast frames
*
* \param base
* Pointer to register area of Ethernet MAC
*
* \param rejectBC if =0 broadcasts are accepted, if =1 they are rejected.
*
*******************************************************************************/
void Cy_ETHIF_SetNoBroadCast(ETH_Type *base, bool rejectBC)
{
    uint8_t u8EthIfInstance;
    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        CY_ASSERT(0UL);
    }
    else
    {
        u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

        cyp_ethif_gemgxlobj->setNoBroadcast((void *)cyp_ethif_pd[u8EthIfInstance],rejectBC);
    }
}


/*******************************************************************************
* Function Name: Cy_ETHIF_SetPromiscuousMode
****************************************************************************//**
*
* \brief Enable/Disable to capture all frames
*
* \param  base Pointer to register area of Ethernet MAC
* \param  toBeEnabled if =1 enables copy all frames mode, if =0 then this is disabled
*
*******************************************************************************/
void Cy_ETHIF_SetPromiscuousMode(ETH_Type *base, bool toBeEnabled)
{
    uint8_t u8EthIfInstance;
    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        CY_ASSERT(0UL);
    }
    else
    {
        u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

        cyp_ethif_gemgxlobj->setCopyAllFrames((void *)cyp_ethif_pd[u8EthIfInstance],toBeEnabled);
    }
}

