RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ethif.c
/*******************************************************************************
* Function : Cy_ETHIF_SetFilterAddress
****************************************************************************//**
*
* \brief Set Filter Address with specific filter number
*
* \param base Pointer to register area of Ethernet MAC
*
* \param  filterNo Filter number
*         config Filter configuration for Ethernet MAC
*
* \param  config config
*
* \return CY_ETHIF_SUCCESS Filter is set
* \return CY_ETHIF_BAD_PARAM Parameter passed contains invalid values
*
* \note
* Maximum 4 filters can be set
*
*******************************************************************************/
cy_en_ethif_status_t Cy_ETHIF_SetFilterAddress(ETH_Type *base, cy_en_ethif_filter_num_t filterNo, const cy_stc_ethif_filter_config_t* config)
{
    uint8_t u8EthIfInstance;
    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        return CY_ETHIF_BAD_PARAM;
    }

    if(filterNo >= CY_ETHIF_FILTER_NUM_INV)
    {
        return CY_ETHIF_BAD_PARAM;
    }

    if(config == NULL)
    {
        return CY_ETHIF_BAD_PARAM;
    }

    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    /* add some address filters */

    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 1, 'Intentional typecast of &config->filterAddr to CEDI_MacAddress* struct type.');
    (void)cyp_ethif_gemgxlobj->setSpecificAddr((void *)cyp_ethif_pd[u8EthIfInstance],
                                        filterNo,
                                        (CEDI_MacAddress*)&config->filterAddr,
                                        config->typeFilter,
                                        config->ignoreBytes);
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3');

    return CY_ETHIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_PhyRegRead
****************************************************************************//**
*
* \brief Local function used by other APIs to read the PHY register.
*
* \param base
* Pointer to register area of Ethernet MAC
*
* \param u8RegNo Register to read
*
* \param u8PHYAddr u8PHYAddr
*
* \return read data from the register
*
* \note
* CY_ETH_PHY_ADDR must match with PHY.
* PHY data-sheet and hardware schematic shall be checked
*
*******************************************************************************/
uint32_t Cy_ETHIF_PhyRegRead(ETH_Type *base, uint8_t u8RegNo, uint8_t u8PHYAddr)
{
    uint32_t    u32result;
    uint16_t    u16ReadData;
    uint8_t u8EthIfInstance;

    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        return (uint32_t)CY_ETHIF_BAD_PARAM;
    }

    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    cyp_ethif_gemgxlobj->phyStartMdioRead( (void *)cyp_ethif_pd[u8EthIfInstance], CY_ETHIF_PHY_FLAG, u8PHYAddr, u8RegNo);

    while(cyp_ethif_gemgxlobj->getMdioIdle((void *)cyp_ethif_pd[u8EthIfInstance]) != CY_ETH_MDIO_BUSY_0)
    {
        /* poll till operation completes */
    }

    /* additional wait before read data */
    Cy_SysLib_DelayUs(800);

    u32result = cyp_ethif_gemgxlobj->getMdioReadData((void *)cyp_ethif_pd[u8EthIfInstance], &u16ReadData);
    if (0UL != u32result)
    {
        u16ReadData = 0;
        CY_ASSERT(0UL);
    }

    return (uint32_t)u16ReadData;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_PhyRegWrite
****************************************************************************//**
*
* \brief Local function used by other APIs to write the PHY register
*
* \param base Pointer to register area of Ethernet MAC
* \param u8RegNo Register to write
* \param u16Data data to write
* \param u8PHYAddr u8PHYAddr
*
* \return CY_ETHIF_SUCCESS Filter is set
* \return CY_ETHIF_BAD_PARAM Parameter passed contains invalid values
*
* \note
* u8PHYAddr must match with PHY.
* PHY data-sheet and hardware schematic shall be checked
*
*******************************************************************************/
cy_en_ethif_status_t Cy_ETHIF_PhyRegWrite(ETH_Type *base, uint8_t u8RegNo, uint16_t u16Data, uint8_t u8PHYAddr)
{
    uint8_t u8EthIfInstance;

    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        return CY_ETHIF_BAD_PARAM;
    }

    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    cyp_ethif_gemgxlobj->phyStartMdioWrite( (void *)cyp_ethif_pd[u8EthIfInstance], CY_ETHIF_PHY_FLAG, u8PHYAddr, u8RegNo, u16Data );
    /* poll till operation completes */
    while (cyp_ethif_gemgxlobj->getMdioIdle((void *)cyp_ethif_pd[u8EthIfInstance]) != CY_ETH_MDIO_BUSY_0)
    {
        /* */
    }

    /* additional wait */
    Cy_SysLib_DelayUs(200);
    return CY_ETHIF_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_ETHIF_GetTimerValue
****************************************************************************//**
*
* \brief Returns the current timer value from TSU register
*
* \param base Pointer to register area of Ethernet MAC
* \param stcRetTmrValue [out] pointer to data structure to return the values
*
* \return CY_ETHIF_SUCCESS Filter is set
* \return CY_ETHIF_BAD_PARAM Parameter passed contains invalid values
*
*******************************************************************************/
cy_en_ethif_status_t Cy_ETHIF_Get1588TimerValue(ETH_Type *base, cy_stc_ethif_1588_timer_val_t *stcRetTmrValue)
{
    uint8_t u8EthIfInstance;

    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        return CY_ETHIF_BAD_PARAM;
    }

    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    if (stcRetTmrValue == NULL)
    {
        return CY_ETHIF_BAD_PARAM;
    }

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional typecast of stcRetTmrValue to CEDI_1588TimerVal* struct type.');
    (void)cyp_ethif_gemgxlobj->get1588Timer((void *)cyp_ethif_pd[u8EthIfInstance], (CEDI_1588TimerVal*)stcRetTmrValue);

