RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ethif.c
    return CY_ETHIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_SetTimerValue
****************************************************************************//**
*
* \brief Setting the current timer value in TSU register
*
* \param base Pointer to register area of Ethernet MAC
* \param pstcTmrValue pointer to data structure to configure register with
*
* \return CY_ETHIF_SUCCESS Filter is set
* \return CY_ETHIF_BAD_PARAM Parameter passed contains invalid values
*
*******************************************************************************/
cy_en_ethif_status_t Cy_ETHIF_Set1588TimerValue(ETH_Type *base, cy_stc_ethif_1588_timer_val_t *pstcTmrValue)
{
    uint8_t u8EthIfInstance;

    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        return CY_ETHIF_BAD_PARAM;
    }

    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    if (pstcTmrValue == NULL)
    {
        return CY_ETHIF_BAD_PARAM;
    }

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional typecast of stcRetTmrValue to CEDI_1588TimerVal* struct type.');
    if (((uint32_t)EOK) != cyp_ethif_gemgxlobj->set1588Timer((void *)cyp_ethif_pd[u8EthIfInstance], (CEDI_1588TimerVal*)pstcTmrValue))
    {
        /* Reason could be Null pointer, hardware does not support TSU or pstcTimerValue.nanosecs>0x3FFFFFFF */
        return CY_ETHIF_BAD_PARAM;
    }

    return CY_ETHIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_DecodeEvent
****************************************************************************//**
*
* \brief Interrupt handler for a particular Ethernet instance. It decodes the
* interrupt cause and calls the appropriate registered callback functions.
*
* \param base Pointer to register area of Ethernet MAC
*
*******************************************************************************/
void Cy_ETHIF_DecodeEvent(ETH_Type *base)
{
    uint8_t u8EthIfInstance;

    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        CY_ASSERT(0UL);
    }
    else
    {
        u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

        (void)cyp_ethif_gemgxlobj->isr((void *)cyp_ethif_pd[u8EthIfInstance]);
    }
}


/*******************************************************************************
* Function Name: Cy_ETHIF_DiscardNonVLANFrames
****************************************************************************//**
*
* \brief With VLAN tagged frame processing setup, this function configure
* MAC to receive only VLAN tagged frames and discard all.
*
* \param base Pointer to Ethernet Instance
* \param enable if =1 reject non-VLAN-tagged frames, if =0 then accept
*
*******************************************************************************/
void Cy_ETHIF_DiscardNonVLANFrames(ETH_Type *base, bool enable)
{
    uint8_t u8EthIfInstance;

    /* check for arguments */
    if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
    {
        CY_ASSERT(0UL);
    }
    else
    {
        u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

        cyp_ethif_gemgxlobj->setVlanOnly((void *)cyp_ethif_pd[u8EthIfInstance], (uint8_t)(enable ? 1 : 0));
    }

}


/*##############################################################################
 *      Internal Functions
 *############################################################################*/


/*******************************************************************************
* Function Name: Cy_ETHIF_EnableInterrupts
****************************************************************************//**
*
* \brief Function initializes enabled Interrupt
*
* \param u8EthIfInstance Ethernet Instance
* \param pstcInterruptList pointer to structure list
*
*******************************************************************************/
static void Cy_ETHIF_EnableInterrupts (uint8_t u8EthIfInstance, cy_stc_ethif_intr_config_t * pstcInterruptList)
{
    uint32_t u32InterruptEn = 0;

    if (pstcInterruptList->btsu_time_match == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_TSU_TIME_MATCH);
    }
    if (pstcInterruptList->bwol_rx == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_WOL_RX);
    }
    if (pstcInterruptList->blpi_ch_rx == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_LPI_CH_RX);
    }
    if (pstcInterruptList->btsu_sec_inc == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_TSU_SEC_INC);
    }
    if (pstcInterruptList->bptp_tx_pdly_rsp == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PTP_TX_PDLY_RSP);
    }
    if (pstcInterruptList->bptp_tx_pdly_req == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PTP_TX_PDLY_REQ);
    }
    if (pstcInterruptList->bptp_rx_pdly_rsp == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PTP_RX_PDLY_RSP);
    }
    if (pstcInterruptList->bptp_rx_pdly_req == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PTP_RX_PDLY_REQ);
    }
    if (pstcInterruptList->bptp_tx_sync == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PTP_TX_SYNC);
    }
    if (pstcInterruptList->bptp_tx_dly_req == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PTP_TX_DLY_REQ);
    }
    if (pstcInterruptList->bptp_rx_sync == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PTP_RX_SYNC);
    }
    if (pstcInterruptList->bptp_rx_dly_req == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PTP_RX_DLY_REQ);
    }
    if (pstcInterruptList->bpause_frame_tx == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PAUSE_FRAME_TX);
    }
    if (pstcInterruptList->bpause_time_zero == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PAUSE_TIME_ZERO);
    }
    if (pstcInterruptList->bpause_nz_qu_rx == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_PAUSE_NZ_QU_RX);
    }
    if (pstcInterruptList->bhresp_not_ok == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_HRESP_NOT_OK);
    }
    if (pstcInterruptList->brx_overrun == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_RX_OVERRUN);
    }
    if (pstcInterruptList->btx_complete == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_TX_COMPLETE);
    }
    if (pstcInterruptList->btx_fr_corrupt == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_TX_FR_CORRUPT);
    }
    if (pstcInterruptList->btx_retry_ex_late_coll == true)
    {
        u32InterruptEn |=((uint32_t)CEDI_EV_TX_RETRY_EX_LATE_COLL);
    }
    if (pstcInterruptList->btx_underrun == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_TX_UNDERRUN);
    }
    if (pstcInterruptList->btx_used_read == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_TX_USED_READ);
    }
    if (pstcInterruptList->brx_used_read == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_RX_USED_READ);
    }
    if (pstcInterruptList->brx_complete == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_RX_COMPLETE);
    }
    if (pstcInterruptList->bman_frame == true)
    {
        u32InterruptEn |= ((uint32_t)CEDI_EV_MAN_FRAME);
    }

    cy_ethif_cfg[u8EthIfInstance].intrEnable = u32InterruptEn;
}

