RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ethif.c
    /*=================================================================================================*/
    /* CTL.ETH_MODE   | Network_config[0] |  Network_config[10]   |     PHY mode                       */
    /*                |     (speed)       | (gigabit_mode_enable) |                                    */
    /*=================================================================================================*/
    /*       2’d0     |          0        |          0            |   MII - 10Mbps                     */
    /*       2’d0     |          1        |          0            |   MII – 100Mbps                    */
    /*       2’d1     |          0        |          1            |   GMII – 1000Mbps                  */
    /*       2’d2     |          0        |          0            |   RGMII – 10Mbps (4bits/Cycle)     */
    /*       2’d2     |          1        |          0            |   RGMII – 100Mbps (4bits/Cycle)    */
    /*       2’d2     |          0        |          1            |   RGMII – 1000Mbps (8bits/Cycle)   */
    /*       2’d3     |          0        |          0            |   RMII – 10Mbps                    */
    /*       2’d3     |          1        |          0            |   RMII – 100Mbps                   */
    /*=================================================================================================*/

    /** Prepare DMA Config register */
    cy_ethif_cfg[u8EthIfInstance].dmaAddrBusWidth    = 0;                                       /* bit30  DMA address bus width. 0 =32b , 1=64b    */
                                                                                                /* 0:32bit 1:64bit         */
    cy_ethif_cfg[u8EthIfInstance].enTxExtBD          = CY_ETH_DEFINE_BD;                               /* bit29  tx_bd_extended_mode_en  */
    cy_ethif_cfg[u8EthIfInstance].enRxExtBD          = CY_ETH_DEFINE_BD;                               /* bit28  rx_bd_extended_mode_en  */
    cy_ethif_cfg[u8EthIfInstance].dmaCfgFlags        = pstcEthIfConfig->u8dmaCfgFlags;          /* bit26  force_max_amba_burst_tx */
                                                                                                /* bit25  force_max_amba_burst_rx */
                                                                                                /* bit24  force_discard_on_err    */
    for (u8QueueCounter=0; u8QueueCounter<cy_ethif_cfg[u8EthIfInstance].rxQs; u8QueueCounter++) {
        cy_ethif_cfg[u8EthIfInstance].rxBufLength[u8QueueCounter] = CY_ETH_SIZE_BUF_TXQ_RXQ >> 6;            /* bit23:16 rx_buf_size       */
    }

    cy_ethif_cfg[u8EthIfInstance].txPktBufSize       = CY_ETH_TX_PBUF_SIZE;                     /* bit10  tx_pbuf_size            */
    cy_ethif_cfg[u8EthIfInstance].rxPktBufSize       = CY_ETH_RX_PBUF_SIZE;                     /* bit9:8 rx_pbuf_size            */
    cy_ethif_cfg[u8EthIfInstance].dmaEndianism       = 0;                                       /* bit7   endian_swap_packet  */
                                                                                                /*        0: little endian mode */
                                                                                                /*        1: endian swap mode enable for packet data (CEDI_END_SWAP_DATA) */
                                                                                                /* bit6   endian_swap_management   */
                                                                                                /*        0: little endian mode    */
                                                                                                /*        1: endian swap mode enable for management descriptor (CEDI_END_SWAP_DESC) */
    cy_ethif_cfg[u8EthIfInstance].dmaDataBurstLen    = (CEDI_DmaDatBLen)pstcEthIfConfig->dmaDataBurstLen;        /* bit4:0   amba_burst_length                                         */
                                                                                                /* 1xxxx: attempt use burst up to 16 (CEDI_DMA_DBUR_LEN_16)  */
                                                                                                /* 01xxx: attempt use burst up to  8 (CEDI_DMA_DBUR_LEN_8)   */
                                                                                                /* 001xx: attempt use burst up to  4 (CEDI_DMA_DBUR_LEN_4)   */
                                                                                                /* 0001x: always use single burst                            */
                                                                                                /* 00001: always use single burst    (CEDI_AMBD_BURST_LEN_1) */
                                                                                                /* 00000: best AXI burst up to 256 beats                     */

    /** Prepare upper_tx_q_base_addr and upper_rx_q_base_addr register (0x4c8, 0x4D4)   */
    cy_ethif_cfg[u8EthIfInstance].upper32BuffTxQAddr = 0;                                       /* bit31:0  not used              */
    cy_ethif_cfg[u8EthIfInstance].upper32BuffRxQAddr = 0;                                       /* bit31:0  not used              */

    /** axi_max_pipeline register    */
    cy_ethif_cfg[u8EthIfInstance].aw2wMaxPipeline    = pstcEthIfConfig->u8aw2wMaxPipeline;      /* bit15:8  aw2w_max_pipeline     */
    cy_ethif_cfg[u8EthIfInstance].ar2rMaxPipeline    = pstcEthIfConfig->u8ar2rMaxPipeline;      /* bit 7:0  ar2r_max_pipeline     */
}


/*******************************************************************************
* Function Name: Cy_ETHIF_WrapperConfig
****************************************************************************//**
*
* \brief Function initializes Ethernet Wrapper to configure Interface mode, reference clock/divider etc
*
* \param u8EthIfInstance Ethernet Instance
* \param pstcInterruptList pointer to structure list
*
* \return CY_ETHIF_SUCCESS Filter is set
* \return CY_ETHIF_BAD_PARAM Parameter passed contains invalid values
*
*******************************************************************************/
static cy_en_ethif_status_t Cy_ETHIF_WrapperConfig(uint8_t u8EthIfInstance, cy_stc_ethif_wrapper_config_t * pstcWrapperConfig )
{
    ETH_Type *base;
    uint32_t mode, srcSel, clkDiv;

