RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ethif.c
    if (pstcWrapperConfig->stcInterfaceSel > CY_ETHIF_CTL_RMII_100)
    {
        return CY_ETHIF_BAD_PARAM;
    }

    //pstcEthConfig = (u8EthIfInstance == CY_ETHIF_INSTANCE_0) ? (stc_ETH_t*)CY_ETH0_ADDR_REG_BASE : (stc_ETH_t*)CY_ETH1_ADDR_REG_BASE;
    base = CY_ETHIF_IP_ADDR_REGBASE(u8EthIfInstance);

    if ((pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_MII_10) ||
       (pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_MII_100))
    {
       mode = 0;
    }
    else if (pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_GMII_1000)
    {
        mode = 1;
    }
    else if ((pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RGMII_10) ||
            (pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RGMII_100) ||
            (pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RGMII_1000))
    {
        mode = 2;
    }
    else if ((pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RMII_10) ||
            (pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RMII_100))
    {
        mode = 3;
    }
    else
    {
        mode = 0;
    }

    srcSel =  (uint32_t)(pstcWrapperConfig->bRefClockSource);
    clkDiv = (((uint32_t)pstcWrapperConfig->u8RefClkDiv) - 1U);        /** NOTE: This bits are not part of eth header file as of now   */

    //pstcEthConfig->unCTL.u32Register = unEthCtl.u32Register;
    ETH_CTL(base) = _VAL2FLD(ETH_CTL_ETH_MODE, mode) |
                    _VAL2FLD(ETH_CTL_REFCLK_SRC_SEL, srcSel) |
                    _VAL2FLD(ETH_CTL_REFCLK_DIV, clkDiv);

    return CY_ETHIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_IPEnable
****************************************************************************//**
*
* \brief Function enables Ethernet MAC
*
* \param base Ethernet Instance
*
*******************************************************************************/
static void Cy_ETHIF_IPEnable(ETH_Type *base)
{
    ETH_CTL(base) |=_VAL2FLD(ETH_CTL_ENABLED, CY_ETH_ENABLE_1);
}

/*******************************************************************************
* Function Name: Cy_ETHIF_IPDisable
****************************************************************************//**
*
* \brief Function Disables Ethernet MAC
*
* \param base Ethernet Instance
*
*******************************************************************************/
static void Cy_ETHIF_IPDisable(ETH_Type *base)
{
    ETH_CTL(base) &= (uint32_t)~(ETH_CTL_ENABLED_Msk);
}

/*******************************************************************************
* Function Name: Cy_ETHIF_AssignMemory
****************************************************************************//**
*
* \brief Local function is used to initialize private data structure, tx and rx queue start address
*
* \param u8EthIfInstance Ethernet Instance number
*
*******************************************************************************/
static void Cy_ETHIF_AssignMemory(uint8_t u8EthIfInstance)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional typecast of cy_ethif_privatedata[u8EthIfInstance] to CEDI_PrivateData* struct type.');
    cyp_ethif_pd[u8EthIfInstance] = (CEDI_PrivateData *)cy_ethif_privatedata[u8EthIfInstance];
    cy_ethif_cfg[u8EthIfInstance].rxQAddr   = (uintptr_t)cy_ethif_rx_desc_list[u8EthIfInstance];
    cy_ethif_cfg[u8EthIfInstance].txQAddr   = (uintptr_t)cy_ethif_tx_desc_list[u8EthIfInstance];
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional typecast of cy_ethif_statistic[u8EthIfInstance] to CEDI_Statistics* struct type.');
    cyp_ethif_statistic[u8EthIfInstance] = (CEDI_Statistics *)cy_ethif_statistic[u8EthIfInstance];
    cy_ethif_cfg[u8EthIfInstance].statsRegs = (uintptr_t)cyp_ethif_statistic[u8EthIfInstance];
    /** get the physical address */
    cy_ethif_cfg[u8EthIfInstance].rxQPhyAddr = cy_ethif_cfg[u8EthIfInstance].rxQAddr;
    /** get the physical address */
    cy_ethif_cfg[u8EthIfInstance].txQPhyAddr = cy_ethif_cfg[u8EthIfInstance].txQAddr;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_DisableQueues
****************************************************************************//**
* \brief By default all activated queues in the IP are enabled. However, only required
* queues for tx and rx shall be enabled to make internal process faster.
*
* \brief Function Disables Ethernet MAC
*
* \param base Ethernet Instance
*
*******************************************************************************/
static cy_en_ethif_status_t Cy_ETHIF_DisableQueues (ETH_Type *base, cy_stc_ethif_mac_config_t * pstcEthIfConfig)
{
    uint8_t u8EthIfInstance;

    u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

    /* Transmit Queue 0 */
    if (pstcEthIfConfig->btxq0enable == false)
    {
        /* Disable the queue pointer */
        ETH_TX_Q_PTR(base) = (ETH_TX_Q_PTR(base) & (uint32_t)~(ETH_TRANSMIT_Q_PTR_DMA_TX_DIS_Q_Msk)) | _VAL2FLD(ETH_TRANSMIT_Q_PTR_DMA_TX_DIS_Q, 1UL);
        stcQueueDisStatus[u8EthIfInstance].bTxQueueDisable[0] = true;
    }

    /* Transmit Queue 1 */
    if (pstcEthIfConfig->btxq1enable == false)
    {
        /* Disable the queue pointer */
        ETH_TX_Q1_PTR(base) = (ETH_TX_Q1_PTR(base) & (uint32_t)~(ETH_TRANSMIT_Q1_PTR_DMA_TX_DIS_Q_Msk)) | _VAL2FLD(ETH_TRANSMIT_Q1_PTR_DMA_TX_DIS_Q, 1UL);
        stcQueueDisStatus[u8EthIfInstance].bTxQueueDisable[1] = true;
    }

    /* Transmit Queue 2 */
    if (pstcEthIfConfig->btxq2enable == false)
    {
        /* Disable the queue pointer */
        ETH_TX_Q2_PTR(base) = (ETH_TX_Q2_PTR(base) & (uint32_t)~(ETH_TRANSMIT_Q2_PTR_DMA_TX_DIS_Q_Msk)) | _VAL2FLD(ETH_TRANSMIT_Q2_PTR_DMA_TX_DIS_Q, 1UL);
        stcQueueDisStatus[u8EthIfInstance].bTxQueueDisable[2] = true;
    }

    /* Receive Queue 0 */
    if (pstcEthIfConfig->brxq0enable == false)
    {
        /* Disable the queue pointer */
        ETH_RX_Q_PTR(base) = (ETH_RX_Q_PTR(base) & (uint32_t)~(ETH_RECEIVE_Q_PTR_DMA_RX_DIS_Q_Msk)) | _VAL2FLD(ETH_RECEIVE_Q_PTR_DMA_RX_DIS_Q, 1UL);
        stcQueueDisStatus[u8EthIfInstance].bRxQueueDisable[0] = true;
    }

