RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ethif.c
    /** derive the instance */
    u8EthIfInstance = Cy_ETHIF_GetEthIfInstance(pcy_privatedata);

    base = CY_ETHIF_IP_ADDR_REGBASE(u8EthIfInstance);

    if (0UL != (u32event & ((uint32_t)CEDI_EV_TX_COMPLETE)))
    {
        (void)cyp_ethif_gemgxlobj->freeTxDesc((void *)cyp_ethif_pd[u8EthIfInstance], u8qnum, &Tx_DescData);

        g_tx_bdcount[u8EthIfInstance]--;

        /* application callback function */
        if (stccallbackfunctions[u8EthIfInstance].txcompletecb != NULL)
        {
            stccallbackfunctions[u8EthIfInstance].txcompletecb(base, u8qnum);
        }

    }

    return;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventTxError
****************************************************************************//**
*
* \brief Function called by cadence driver upon getting Tx Error Event
*
* \param pcy_privatedata    Instance specific private data
* \param u32event occurred event
* \param u8qnum Queue number
*
*******************************************************************************/
static void Cy_ETHIF_EventTxError(void *pcy_privatedata, uint32_t u32event, uint8_t u8qnum)
{
    CEDI_TxDescData Tx_DescData;
    uint8_t u8EthIfInstance;
    ETH_Type *base;

    /** derive the instance */
    u8EthIfInstance = Cy_ETHIF_GetEthIfInstance(pcy_privatedata);

    base = CY_ETHIF_IP_ADDR_REGBASE(u8EthIfInstance);

    (void)cyp_ethif_gemgxlobj->freeTxDesc((void *)cyp_ethif_pd[u8EthIfInstance], u8qnum, &Tx_DescData);

    /** application callback function */
    if (stccallbackfunctions[u8EthIfInstance].txerrorcb != NULL)
    {
        stccallbackfunctions[u8EthIfInstance].txerrorcb(base, u8qnum);
    }

    g_tx_bdcount[u8EthIfInstance]--;

    CY_UNUSED_PARAMETER(u32event); /* Suppress a compiler warning about unused variables */

    return;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventRxFrame
****************************************************************************//**
*
* \brief Function called by cadence driver upon getting Rx Event
*
* \param pcy_privatedata    Instance specific private data
* \param u8qnum Queue number
*
*******************************************************************************/
static void Cy_ETHIF_EventRxFrame(void *pcy_privatedata, uint8_t u8qnum)
{
    uint32_t        u32RxNum;
    CEDI_BuffAddr   tmpBufAddr;
    CEDI_RxDescData Rx_DescData;
    CEDI_RxDescStat Rx_DescStat;
    uint8_t u8EthIfInstance = 255;
    ETH_Type *base;
    uint32_t bufLen;
    bool noData = false;
    uint8_t *rxBufAddr;

    /* derive the instance */
    u8EthIfInstance = Cy_ETHIF_GetEthIfInstance(pcy_privatedata);

    base = CY_ETHIF_IP_ADDR_REGBASE(u8EthIfInstance);
    /* number of used buffers */
    u32RxNum = cyp_ethif_gemgxlobj->numRxUsed((void *)cyp_ethif_pd[u8EthIfInstance], u8qnum);

    /** read receive queue */
    while (0UL != u32RxNum)
    {
        tmpBufAddr.pAddr = 0;
        tmpBufAddr.vAddr = tmpBufAddr.pAddr;
        bufLen = 0;
        if (stccallbackfunctions[u8EthIfInstance].rxgetbuff != NULL)
        {
            stccallbackfunctions[u8EthIfInstance].rxgetbuff(base, (uint8_t**)&rxBufAddr, &bufLen);
            tmpBufAddr.pAddr = (uintptr_t)rxBufAddr;
            tmpBufAddr.vAddr = tmpBufAddr.pAddr;
        }

        (void)cyp_ethif_gemgxlobj->readRxBuf((void *)cyp_ethif_pd[u8EthIfInstance],
                                          u8qnum,
                                          &tmpBufAddr,
                                          CY_ETHIF_BUFFER_CLEARED_0,
                                          &Rx_DescData);

        switch ((CEDI_RxRdStat)Rx_DescData.status)
        {
          case CEDI_RXDATA_SOF_EOF:     // 0
            /* receive start and end frame */
            cyp_ethif_gemgxlobj->getRxDescStat((void *)cyp_ethif_pd[u8EthIfInstance],
                                         Rx_DescData.rxDescStat,
                                         &Rx_DescStat);

            /* application callback function */
            if (stccallbackfunctions[u8EthIfInstance].rxframecb != NULL)
            {
                stccallbackfunctions[u8EthIfInstance].rxframecb(base, (uint8_t*)tmpBufAddr.pAddr, Rx_DescStat.bufLen);
            }
            break;
          case CEDI_RXDATA_SOF_ONLY:    // 1
            /* fragment start */
            // debug_printf("[ETH] (SOF)Don't use fragment yet...\r\n");
            break; //return;
          case CEDI_RXDATA_NO_FLAG:     // 2
            /* fragment */
            // debug_printf("[ETH] (NOF)Don't use fragment yet...\r\n");
            break; //return;
          case CEDI_RXDATA_EOF_ONLY:    // 3
            /* fragment end */
            // debug_printf("[ETH] (EOF)Don't use fragment yet...\r\n");
            break;
          case CEDI_RXDATA_NODATA:      // 4
            /* normal leaving */
            // debug_printf("[ETH] NG5 RXDATA_NODATA\r\n");
            noData = true;
            break;
          default:
            /* Unknown status */
            break;
        }
        if(noData)
        {
            break;/* from here it breaks while loop   */
        }
        u32RxNum--;
    }
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventRxError
****************************************************************************//**
*
* \brief Function called by cadence driver upon getting Rx Error Event
*
* \param pcy_privatedata    Instance specific private data
* \param u32event occurred event
* \param u8qnum Queue number
*
*******************************************************************************/
static void Cy_ETHIF_EventRxError(void *pcy_privatedata, uint32_t a_event, uint8_t a_qnum)
{
    //printf("[ETH] (Event) RxError received.\r\n");
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(a_event); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(a_qnum); /* Suppress a compiler warning about unused variables */

    return;
}

